In [1]:
import numpy as np
import pandas as pd

- 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan #인덱스값 3번째를  NaN 바꾸기
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [9]:
s.count()

9

In [10]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df


#[2,3]인데 왜 저기가 NaN?

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [9]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [2]:
import seaborn as sns
titanic =sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [12]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기 value_counts()

In [13]:
titanic.survived.value_counts() #survived 컬럼의 값을 알려줌

0    549
1    342
Name: survived, dtype: int64

In [17]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

- 정렬

In [20]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [22]:
df[0].sort_values()

0    0.0
1    3.0
2    3.0
3    4.0
Name: 0, dtype: float64

In [23]:
df[0].sort_values(ascending =False) #내림차순순

3    4.0
1    3.0
2    3.0
0    0.0
Name: 0, dtype: float64

In [25]:
df[3].sort_values()

1    1.0
0    2.0
3    2.0
2    NaN
Name: 3, dtype: float64

In [ ]:
df[3].sort_values(by =0)

In [26]:
titanic.embarked.value_counts()#값이 많은거대로 나옴

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [28]:
titanic.embarked.value_counts().sort_index() #인덱스로 sort하면 알파벳 순으로 나옴

C    168
Q     77
S    644
Name: embarked, dtype: int64

- 행/열 합계

In [30]:
np.random.seed(2021)
df2 = pd.DataFrame(np.random.randint(10,size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  4  5  9  0  6  5  8  6
1  6  6  6  1  5  7  1  1
2  5  2  0  3  1  0  2  6
3  4  8  5  1  6  7  5  6

In [10]:
df2['RowSum']=df2.sum(axis =1) #RowSum 이라는 컬럼을 만들어서 행으로 더한값 넣기
df2

   0  1  2  3  4  5  6  7  RowSum
0  0  3  9  8  4  3  6  5      38
1  9  0  0  2  2  4  6  2      25
2  5  1  1  8  0  4  3  7      29
3  6  6  7  2  8  9  9  7      54

In [11]:
df2.sum() #default axis가 0

0          20
1          10
2          17
3          20
4          14
5          20
6          24
7          21
RowSum    146
dtype: int64

In [12]:
df2.mean()

0          5.00
1          2.50
2          4.25
3          5.00
4          3.50
5          5.00
6          6.00
7          5.25
RowSum    36.50
dtype: float64

In [34]:
df2.std() #표준편차

0          0.957427
1          2.500000
2          3.741657
3          1.258306
4          2.380476
5          3.304038
6          3.162278
7          2.500000
RowSum    11.116804
dtype: float64

In [14]:
df2.describe()

,0,1,2,3,4,5,6,7
count,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.00000,4.00000
mean,3.750000,3.000000,3.250000,2.500000,3.000000,4.250000,3.75000,3.50000
std,2.629956,2.160247,4.031129,3.785939,0.816497,1.258306,3.86221,0.57735
min,0.000000,0.000000,0.000000,0.000000,2.000000,3.000000,0.00000,3.00000
25%,3.000000,2.250000,0.750000,0.000000,2.750000,3.750000,0.75000,3.00000
50%,4.500000,3.500000,2.000000,1.000000,3.000000,4.000000,3.50000,3.50000
75%,5.250000,4.250000,4.500000,3.500000,3.250000,4.500000,6.50000,4.00000
max,6.000000,5.000000,9.000000,8.000000,4.000000,6.000000,8.00000,4.00000

- apply 변환

In [3]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [40]:
# apply(lambda x: x최댓값-x최솟값)
df3.apply(lambda  x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [41]:
#axis=1 행으로 계산해서 구하기 
df3.apply(lambda  x: x.max() - x.min(), axis =1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [44]:
# adult/child 변수를 만들고 그 변수에 adult를 넣는다 20이상이면 아니면 child 
titanic['adult/child'] = titanic.apply(
    lambda r:'adult' if r.age >= 20 else 'child',axis = 1
)
titanic.tail()

#이거 왜 axis=1이지?

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

- fillna
#####  NaN 평균값/중앙값/최빈값 대체, 삭제

In [5]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [6]:
# NaN값을 0.0으로 대체 
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

- astype 메소드

In [49]:
#astype() 타입 바꾸기 float -> int

df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

- 실수 값을 카테고리 값으로 변환

In [7]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

- pd.cut : 동일 길이로 나누어서 범주 만들기

In [53]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [54]:
cats[8]

'미성년자'

In [55]:
type(cats)

pandas.core.arrays.categorical.Categorical

- qcut: 동일 개수로 나누기

In [56]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4, labels=["Q1", "Q2", "Q3", "Q4"])
cats

['Q2', 'Q3', 'Q4', 'Q1', 'Q1', ..., 'Q1', 'Q2', 'Q1', 'Q3', 'Q1']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [57]:
pd.value_counts(cats)

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64